Repository: 0000duck/scilab
Catalog: scilab/modules/jvm/locales/*/messages.po
Languages: fr_fr

source: Could not access to the Main Scilab Class :
fr_fr: Impossible d'accéder à la classe principale de Scilab:

source: Could not create a Scilab main class. Error :
fr_fr: Impossible de créer la classe principale Scialb. Erreur :

source: Error: could not parse file %s
fr_fr: Erreur: Impossible d'analyser (parser) le fichier %s

source: Wrong format for %s.
fr_fr: Mauvais format dans %s.

source: Error : Not a valid classpath file %s (encoding not 'utf-8') Encoding '%s' found
fr_fr: Erreur : Fichier de déclaration des classpaths invalide %s (codage non 'utf-8') Codage '%s' trouvé

source: Scilab cannot open JVM library.
fr_fr: Scilab n'a pas pu ouvrir la bibliothèque de la JVM.

source: Error
fr_fr: Erreur

source: Error : Not a valid path file %s (encoding not 'utf-8') Encoding '%s' found
fr_fr: Erreur : Fichier de déclaration des chemins (path) invalide %s (codage non 'utf-8') Codage '%s' trouvé

source: Unknown JNI error
fr_fr: Erreur JNI inconnue

source: Thread detached from the VM
fr_fr: Thread détaché de la machine virtuelle

source: JNI version error
fr_fr: Erreur de la version de JNI

source: JNI: not enough memory
fr_fr: JNI : pas assez de mémoire

source: VM already created
fr_fr: Machine virtuelle déjà crée

source: JNI: invalid arguments
fr_fr: JNI : arguments incorrects

source: Undefined error code in the JNI. Weird problem
fr_fr: Code erreur JNI indéfini. Problème étrange

source: Error: Cannot return Scilab Java environment (jvm_SCILAB): check if the JVM has been loaded by Scilab before calling this function.
fr_fr: Erreur: Impossible de retourner la variable d'environnement Scilab (jvm_SCILAB): verifier si la JVM a été correctement chargé avant d'appeller cette fonction.

source: Incorrect version JNI (needs at least JDK 1.4).
fr_fr: Mauvaise version de JNI (au moins JDK 1.4)

source: Error in the creation of the Java VM : %s
fr_fr: Erreur lors de la création de la machine virtuelle Java : %s

source: Call to AttachCurrentThread.
fr_fr: Appel à AttachCurrentThread.

source: Scilab Java module not installed.
fr_fr: Module Scilab/Java non installée.

source: could not add path to java.library.path : %s.
fr_fr: Impossible d'ajouter le chemin à java.library.path : %s.

source: invalid parameter(s).
fr_fr: Paramètre(s) incorrecte(s).

source: could not add URL to system classloader : %s.
fr_fr: Impossible d'ajouter l'URL au classloader système: %s.

source: invalid parameter.
fr_fr: Paramètre incorrecte.

source: JVM interface disabled in -nogui or -nwni modes.
fr_fr: Java interface désactivée dans les modes -nogui ou -nwni.
