Repository: 0000duck/scilab
Catalog: scilab/modules/fftw/locales/*/messages.po
Languages: fr_fr

source: Scilab FFTW module not installed.
fr_fr: Module Scilab FFTW non installé.

source: %s: Bad type for the first input parameter
fr_fr: %s: Mauvais type pour le premier argument d'entrée

source: %s: Memory allocation error
fr_fr: %s: Erreur d'allocation mémoire

source: %s: FFTW can't read wisdom
fr_fr: %s: FFTW ne peut pas créer wisdom

source: %s: Bad type for the input parameter
fr_fr: %s: Mauvais type de l'argument d'entrée

source: FFTW Library %s not found.
fr_fr: Bibliothèque FFTW %s introuvable.

source: FFTW Library not found.
fr_fr: Bibliothèque FFTW introuvable.

source: %s: Wrong number of input arguments, expecting 3.
fr_fr: %s: Mauvais nombre d'argument d'entrée, 3 attendus.

source: %s: Wrong type for the second input argument, expecting matrix.
fr_fr: %s: Mauvais type pour le deuxième argument d'entrée, matrice attendue.

source: %s: Wrong value for the second input argument.
fr_fr: %s: Mauvaise valeur pour le deuxième argument d'entrée

source: %s: Wrong type for the third input argument.
fr_fr: %s: Mauvais type pour le troisième argument d'entrée

source: %s: Wrong size for the third input argument
fr_fr: %s: Mauvaise taille pour le troisième argument d'entrée

source: %s: Wrong type for the fourth input argument
fr_fr: %s: Mauvaise type pour le quatrième argument d'entrée

source: %s: Wrong size for the fourth input argument
fr_fr: %s: Mauvaise taille pour le quatrième argument d'entrée

source: %s: Size of the third and fourth input arguments must be the same
fr_fr: %s: La taille du troisième et quatrième arguments d'entrée doit être la même

source: %s: Wrong value for the third input argument : %d
fr_fr: %s: Mauvaise valeur pour le troisième argument d'entrée : %d

source: %s: Wrong value for the fourth input argument : %d
fr_fr: %s: Mauvaise valeur pour le quatrième argument d'entrée : %d

source: Invalid parameter type.
fr_fr: Type du paramètre incorrect.
